javanotes.org
#+TITLE: Learning java in my own way


* java






** java, sql, parallels : helsinki java sms example : fixed

I see that there are parallels with SQL and java. 

Create a hashmap and populate that with the put() command. 

Hashmap is like an array-list and object and it contains objects. 

Like a table with columns or attributes

The table is a table for library and contains two attributes or columns, the name of the book and the name of the lender. The name of the book or the book can be a unique object, we define it separately. The name of the lender is just a string or if we want we can make it an object with its own attributes. 
This is one way of thinking about it. Seems like you can learn some more SQL and relational algebra while you are at it. 

Consider the object sms or the class sms, class sms that makes the object sms. Whatever. 

We consider sms. It has two attributes, string, string. That is nice. 
One way to think about sms is that one string is the name of the sender and the other string is the message itself. 

You can create a lot of sms object with new. 

Consider an array-list of sms objects. Array-list can be visualized as a table with a single column. In this case the column will contain many sms objects. List of sms objects in this table. 

Other kind of tables are like hashmaps. Hasmap table has two columns, one is usually some string and the other is usually some kind of object. 

What could be the use of a hashmap object, idk. 

Consider the class ebook, this has two attributes, string and array-list of string

All of this makes the whole thing a lot more easier than it used to be. 

Trying to think. 

So any object and you represent it with an empty box, this is a table, it can be but not always. 

Objects have related methods or functions, we do not care about any function unless that function returns an object in the sense that the object is not string or int but only if the object is a constructed object or an array-list or a hashmap. Do collections and sets count? idk, for this moment. 

The objects that have constructors that can be empty, then an empty box

Objects whose constructors consists of attributes like int or string. Empty  box with a list of that. 

Object whose constructors have as attributes lists like hashmap or array-list or a combination of string or array-list, string and hashmap, int and array-list. Any of that kind of combination. . this is a proper box with a table. 

Consider only those methods that return objects like array-list or hashmap or other constructed objects. 


** java : objects fixed

There are n number of objects in your files, they can all be brought forth independently. 

n objects. how ever they are arranged in some peculiar ways.
Objects can contain arraylists
Objects can contain other objects
Hashmap can contain objects

Arraylist you can get this out and put it into a set or collection
Hashmap, you can extract the key or the values and then put them into a set or a collection

n objects, there are no lists like arraylist or hashmaps

Objects can have methods, we would only consider those methods that have a return type of an object

object1--method1--object2

Objects are not functions but objects can have functions that do something to other objects. Like generate other objects

But all of that depends on the main. 


** java: making sense of objects fixed

Objects, those objects like say pen, paper or name of people, the sort of objects that are just an individual identity and nothing to do with storing in lists or whatever are made up of properties or attributes. 

Like an object say a person, has a name, can walk, run, sing, dance, has an address and so on. So lots of attributes. 
Now the attributes are there. 

The object can also have functions, objects are sort of placeholders for functions. 

So each object can have so many functions. Object. Fun1(), object. Fun2() and so on. 
These functions are attached to the object in question. 

It is possible to import an external function and make it look like it is the function of that object itself. 

So basically an object that burrows a function from another object and presents it as its own. 

No it is not a superclass or an abstract class or an interface. None of that, it is just a separate class. 

#+BEGIN_SRC java

object.fun3()
and fun() calls a function from object2
how would you go about importing this function of another object
fun2()
new object2;

fun2 -->> object2.fun_to_be_imported()
so each time you call fun2(), you are calling that other function.

#+END_SRC


