javanotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Learning java in my own way</title>
<!-- 2018-10-28 Sun 20:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="majhi" />
</head>
<body>
<div id="content">
<h1 class="title">Learning java in my own way</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. java</a>
<ul>
<li><a href="#sec-1-1">1.1. java, sql, parallels : helsinki java sms example : fixed</a></li>
<li><a href="#sec-1-2">1.2. java : objects fixed</a></li>
<li><a href="#sec-1-3">1.3. java: making sense of objects fixed</a></li>
<li><a href="#sec-1-4">1.4. reference variables, i think you got the wrong idea here : fixed</a></li>
<li><a href="#sec-1-5">1.5. observer pattern : fixed</a></li>
<li><a href="#sec-1-6">1.6. factory pattern : fixed</a></li>
<li><a href="#sec-1-7">1.7. factory pattern : fixed</a></li>
<li><a href="#sec-1-8">1.8. java keyword: protected : fixed</a></li>
<li><a href="#sec-1-9">1.9. singleton pattern : fixed</a></li>
<li><a href="#sec-1-10">1.10. command pattern : fixed</a></li>
<li><a href="#sec-1-11">1.11. adapter pattern : fixed</a></li>
<li><a href="#sec-1-12">1.12. factory pattern :fixed</a></li>
<li><a href="#sec-1-13">1.13. decorator pattern : fixed</a></li>
<li><a href="#sec-1-14">1.14. template pattern : fixed</a></li>
<li><a href="#sec-1-15">1.15. thinking about java oop : fixed</a></li>
<li><a href="#sec-1-16">1.16. treating collection objects in java as boxes ??</a></li>
<li><a href="#sec-1-17">1.17. iterator pattern: waitress object fixed</a></li>
<li><a href="#sec-1-18">1.18. composite pattern fixed</a></li>
<li><a href="#sec-1-19">1.19. the back curving arrow fixed</a></li>
<li><a href="#sec-1-20">1.20. composite pattern fixed</a></li>
<li><a href="#sec-1-21">1.21. strategy pattern</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> java</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> java, sql, parallels : helsinki java sms example : fixed</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I see that there are parallels with SQL and java. 
</p>

<p>
Create a hashmap and populate that with the put() command. 
</p>

<p>
Hashmap is like an array-list and object and it contains objects. 
</p>

<p>
Like a table with columns or attributes
</p>

<p>
The table is a table for library and contains two attributes or columns, the name of the book and the name of the lender. The name of the book or the book can be a unique object, we define it separately. The name of the lender is just a string or if we want we can make it an object with its own attributes. 
This is one way of thinking about it. Seems like you can learn some more SQL and relational algebra while you are at it. 
</p>

<p>
Consider the object sms or the class sms, class sms that makes the object sms. Whatever. 
</p>

<p>
We consider sms. It has two attributes, string, string. That is nice. 
One way to think about sms is that one string is the name of the sender and the other string is the message itself. 
</p>

<p>
You can create a lot of sms object with new. 
</p>

<p>
Consider an array-list of sms objects. Array-list can be visualized as a table with a single column. In this case the column will contain many sms objects. List of sms objects in this table. 
</p>

<p>
Other kind of tables are like hashmaps. Hasmap table has two columns, one is usually some string and the other is usually some kind of object. 
</p>

<p>
What could be the use of a hashmap object, idk. 
</p>

<p>
Consider the class ebook, this has two attributes, string and array-list of string
</p>

<p>
All of this makes the whole thing a lot more easier than it used to be. 
</p>

<p>
Trying to think. 
</p>

<p>
So any object and you represent it with an empty box, this is a table, it can be but not always. 
</p>

<p>
Objects have related methods or functions, we do not care about any function unless that function returns an object in the sense that the object is not string or int but only if the object is a constructed object or an array-list or a hashmap. Do collections and sets count? idk, for this moment. 
</p>

<p>
The objects that have constructors that can be empty, then an empty box
</p>

<p>
Objects whose constructors consists of attributes like int or string. Empty  box with a list of that. 
</p>

<p>
Object whose constructors have as attributes lists like hashmap or array-list or a combination of string or array-list, string and hashmap, int and array-list. Any of that kind of combination. . this is a proper box with a table. 
</p>

<p>
Consider only those methods that return objects like array-list or hashmap or other constructed objects. 
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> java : objects fixed</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are n number of objects in your files, they can all be brought forth independently. 
</p>

<p>
n objects. how ever they are arranged in some peculiar ways.
Objects can contain arraylists
Objects can contain other objects
Hashmap can contain objects
</p>

<p>
Arraylist you can get this out and put it into a set or collection
Hashmap, you can extract the key or the values and then put them into a set or a collection
</p>

<p>
n objects, there are no lists like arraylist or hashmaps
</p>

<p>
Objects can have methods, we would only consider those methods that have a return type of an object
</p>

<p>
object1&#x2013;method1&#x2013;object2
</p>

<p>
Objects are not functions but objects can have functions that do something to other objects. Like generate other objects
</p>

<p>
But all of that depends on the main. 
</p>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> java: making sense of objects fixed</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Objects, those objects like say pen, paper or name of people, the sort of objects that are just an individual identity and nothing to do with storing in lists or whatever are made up of properties or attributes. 
</p>

<p>
Like an object say a person, has a name, can walk, run, sing, dance, has an address and so on. So lots of attributes. 
Now the attributes are there. 
</p>

<p>
The object can also have functions, objects are sort of placeholders for functions. 
</p>

<p>
So each object can have so many functions. Object. Fun1(), object. Fun2() and so on. 
These functions are attached to the object in question. 
</p>

<p>
It is possible to import an external function and make it look like it is the function of that object itself. 
</p>

<p>
So basically an object that burrows a function from another object and presents it as its own. 
</p>

<p>
No it is not a superclass or an abstract class or an interface. None of that, it is just a separate class. 
</p>

<div class="org-src-container">

<pre class="src src-java">object.fun3()
and fun() calls a function from object2
how would you go about importing this function of another object
fun2()
new object2;

fun2 --&gt;&gt; object2.fun_to_be_imported()
so each time you call fun2(), you are calling that other function.
</pre>
</div>
</div>
</div>
