javanotes.org
** reference variables, i think you got the wrong idea here : fixed

In a class declaration, if you are referring to other class functions, you have to refer to those other classes, you do so with reference variables. 

OtherClass otherobject; <<-- otherobject is an object derived from the other class. 

Now you can call the functions afforded by that other class. 

Now why was such a thing done. 

You see, you have this object which has attributes and like all objects it has a plethora of functions. 
Now we have variations of this object, which means the functions and their implementations would vary. This calls for segregating the functions into two groups, those that change a lot and those that are fairly constant. For those which are constant, put them into the abstract class the super abstract class, so that all the sub classes would inherit the code by polymorphism, (is this right?)
Strike that, not polymorphism but the correct term is inheritance. 

And those that differ in their implementation can be put into an interface that the classes would inherit but they would have their own implementation. 
So far so good. 

We can do further things as regards the former use of super abstract classes where we put the implementations of common and constant functions. 

We could take the functions out of that class and put it in a separate class unrelated by inheritance or extension, not a superclass or interface, but a separate unique object. 
And the functions are kept there separately

So the objects and the way you present them regarding the functions or maintainability of it is basically three kinds. The one with the superclasses affording inheritance, the one where we use interfaces, (is this polymorphism), and the last one where we separate the functions from the parent class and put it in a separate class unrelated by inheritance or otherwise. 

Note: all of this is for the sole purpose of making maintenance of code easier. 








