javanotes.org
** observer pattern : fixed

Three components, subject, observer and display. Subject has a list of observers, like in an array-list. Functions like add observers to this list, remove observers from this list and notify observers in this list. Observer(subject)

That dis not make any sense. 

Not very well defined, this observer pattern. 

What do we have are basically two parts, the subject and the observer. In the main you have to create a subject and then an observer. That is pretty much it. 

The subject has attributes, has functions, has lists. It keeps observers into a list, hence the related functions, addobserver(), removeobserver(), notifyobserver(). 

Subject is kind of passive, you call it or create it once and that is it. The functions that populate observer into the list of subject like addobserver(), removeobserver(), notifyobserver() are called from the observer object. 
 
The observer takes subject object as args in its constructor and then uses that to call the functions of subject. So subject is kind of like the inert passive dead-body with inert organs and observer is using those organs borrowed from subject. 
Sorry, it is a little diff. 

It is like say two wheels which are connected by a drive belt. The two wheels are the two objects and the drive belt represents the functions that connect the two. Create wheel1 and wheel2 now trigger wheel1, which would then trigger wheel2. But all of the underlying functions that connect the two are hidden. 
 
Subject and observer. Trigger subject, which then triggers observers. 
Subject and observer, subject has a list of observers. Trigger subject which then would trigger the list of observers. 
 
Ignore all those interfaces or classes or super-classes for the moment. These two, subject and observer are distinct classes with no such relation between them. Apart from that, one object has a list which is populated with the other object. And the other object calls or uses the function of the other object. The constructor of observer is that pinhole type, like it makes it automatically register or populate itself into subjects list on its creation. The creation of the object brings into existence so many functions and the mandatory actions or the pre-condition (for all of this to work) is put into the constructor, so that on its creation all the prior stuff is already done. So all you are left to do is the other stuff. 
 
Do not really understand the stuff about separating out the functions into the separate interfaces. Seems kind of daft, adding to the complexity. Maybe this can be done as an afterthought. 
 
To keep things simple, there are two major components, the subject and the observer. 
 
So again we have two objects, one of them has a list in which is kept the other object. And then that object will run a function of those other object in the list. And then the other object uses some functions of the first object. 
 
It is like the two classes are intertwined in the sense that one of them has a list for the other object and both of them use the function of the other guy. One creates a list of the other object, and the second one takes the first object as argument in the constructor. 
 
Now to keep things simple that is using only two main components and not more than that, you have basically two main classes and then squeeze out some of the functions and put them into some interfaces, which can either be implemented by the one or the other class. So irrespective of how complex it might get in the sense of how many sub classes that you spawn off, there would still be two main pivot point in sense of the two main abstract classes. 
 
So observer pattern, two main classes, the concept being one is the subject and the other is the observer, garnish with a lots of interfaces and however much sub classes. 
 
There is an observer pattern API, how do you use that?

The API goes like the following. 
 
There are two parts. As observer pattern has two main parts. The subject and the observer. Or observer and the observable. 

 

The interface observer and the super-class observable. You put your observer classes to extend the observer interface. And the observable classes to extend the super-class observable. 
That is nice. 

There should be built in functions, which we can explore by going on into the IDE and checking out all the possibilities. But then we do not have to invest in something that is like built in that we have to have a working knowledge of the pattern on which it is based on. It could have variations and maybe do different things and might change as it evolves with incriminating versions, the pattern behind it would be the same. 

Keep the background pattern theory simple and planted. No mucking about. 

Decorator pattern as just an example, just keep it simple and there is no need to bring in any kind of complexity. 

How do you go about doing it. 

Imagine you have a beverage shop and you sell some kind of beverage, and there are addons for that beverage like say addon one, two and three and four and so on. Now you could sell them as beverage only, or beverage plus one, or beverage plus three or beverage plus two plus four and so on. There are so many different kind of combinations that are possible. So what do you do is go to the decorator pattern. 

See all of these like the beverage and the addons like one, two, three and so on are of the same kind or type or basically the same kind of object. 

The addons object have a constructor that takes the main beverage or other addons as an argument. 
That is the basic premise of this decorator pattern, you have a bunch of objects and then the objects can take other objects as arguments and since they have similar kind of attributes, like say cost or description or whatever, you can chain together the two and make a combination of the two and so on. Basically you can build one on top of the other. I am blabbering, this one is more clear than the observer pattern. 

So decorator pattern is easier than your observer pattern. 

Now they are telling me about this io package in java, so what are you going to do about it. The thing is that they are throwing around terms like API and stuff like that and these are prewritten code in the java library basically what is going on is that you have the code which reflect or which are based on what you just learnt like the design pattern stuff that is like for the decorator pattern you have java packages / API that is a particular java package, in this case the decorator package. And there would be some quirks but then that is all about it. 

And then there are other packages that reflect or are similar to the decorator pattern, in this case the java io package. 

Now that you know about the decorator pattern you could look into this decorator package. 
Now that you know about the decorator pattern you could look at the io package. 

Have to hunt for examples in java that use io package or the decorator package. 
Need to make this simple, this is regarding the factory pattern. 

The whole problems seems to have come about from the whole pizza thing. We have pizza object and there are whole lot of varieties and then there is the whole nightmare about maintainers of all these concrete implementations of pizza varieties. 


