javanotes.org
** factory pattern : fixed

Enter factory pattern

So here is how it goes, the whatever receives a string query about a type of pizza to dispense and this goes to the factory object as string. 

So basically it would do if so and so string then return so and so pizza object. That is the function of factory. This factory object returns different pizza objects. Object a takes a string argument and returns object b. 

So factory object has nothing to do with the pizza object, all it does is return pizza object. 
Then there is another object, the store object, the store object references factory object and makes it to create a pizza object. 

So store object is not related to the factory object and which is again not related to the pizza object. 

What could be the use of this? for one maintenance maybe, you have three separate classes not related to each other and they are referencing one another. The store calls on the factory and the factory returns the pizza object. 

So three objects, the store, factory and pizza. 

In fact in the main you would have to create only the store object, which would then take a string as argument, it would create a factory object and then pass the string to it. And the factory would produce the pizza object. 

So in the main, you do not have to create the factory or the pizza objects. The only thing that you have to create is the store object which takes a string argument. 

That is all. The factory object is created internally, you do not have to worry about it and similarly the pizza objects are all taken care of, you do not have to manually create any of them. 
Store, factory and pizza. Where you only create the store object and pass a string to it. 
Store create the factory and factory creates the pizza. 

This is the factory pattern. 

You can see that this affords us other possibilities. 

Say you have two or three types of store objects, and two or three types of factory object. 

You create a particular type of store object and pass a string to ti. It would create the appropriate factory depending on the string and then the factory would create the pizza. 

As for the pizza object, you could if there are many combinations possible as regards the ingredients, do something like the decorator pattern for the pizza stuff. 

I am missing something, so what is the use of this factory pattern. 

There is difference between simple factory and factory. So the question arises what I just did was what?
See reddit for diff between simple factory and factory. 

I use this separate lingo, they say that there is the super types or the super classes or the abstract classes and then there are those that extend those and they are the concrete classes. 
So the question comes that there is a single branch or there is possible more branches down the road and in that case which one is the abstract and which one is the concrete. The top most would be the abstract, even if we could make objects out of them we would not make objects out of the top tier classes and to enforce this they use the keyword abstract. But then if there are more than one branches and there are sub-classes or more sub-classes after the concrete classes then what. 

We cannot do something like down the branch add the keyword abstract, can we. 

Maybe it is just an understanding that you have branching and if that is one stage of branching then you have one the top tier one that would be called the abstract and to enforce that in good measure throw in the keyword abstract and then the rest beneath it are the concretes. 
Factory pattern is getting complicated, the first one was very simple

You had three basic objects, store, factory and pizza. 

Store would reference the factory object and then factory object would produce the pizza object. 
Simple. 

Another kind I am seeing is

Store takes string args for the kind of pizza and this goes to an if then else if kind of conditional which then calls on pizza object. The pizza object internally calls on the factory object to provide all the ingredients. 

Store to pizza object to factory object. 

Factory object is not even in the picture, we deal with the store object the store creates the pizza object and the pizza object takes care of the factory or deals with the factory internally. And this way factory is hidden away. 

All in all I am not very sure about this whole affair. 

There are functions and these functions are tied to objects. We have to create an object to use the function provided by it. The object can then call on other objects or reference other objects (internally, behind the doors, under the bonnet) so we do not have to deal with all that. These are parts that are hidden away. 

So what is the factory pattern. Idk, we only had to create a store object and pass to it string arguments about the kind of pizza we want. All the functions of the pizza object and all the functions of the factory object are never seen by us. 

If this were functional programming and all the steps were essential we would have to write everything down step by step and use something like the if else else if or else if or case ecase sort of conditional to execute a specific block of code that would give us the product that we want. 

This is doable, sort of. 

The dependency inversion principle. 

There are components and they are high level components and low level components and there is a dependency among them and it is directional that is the high level components depend on the low level components right? like if pizza is the high level component and the low level components are the ingredients that are used to make the pizza then the ingredients do not depend on the pizza but rather the pizza depends on the ingredients. 

Another thing is that the components here are not really of one class but separate distinct classes. There is no relation between the classes. 

Ingredients are ingredients and pizza is pizza. Separate classes and here we are talking about dependency and there is a directional nature of this dependency and here we are talking about the direction of this dependency. 

The principles say, "depend on abstractions and do not depend on concrete implementations"
So there is a directional way in which the pizza object depends on the ingredients. We cannot flip this, can we? no we cannot but what they are saying is that the pizza object should depend on the abstract classes of ingredients rather than the concrete implementation of ingredients. Is that what they are saying. 

So if there are two objects and the two are related in the sense that one refers to the other then make it so that the head of ones arrow points to such things as interfaces and abstract classes rather than to concrete classes. 

That makes sense, say you have two objects a and b. A refers to b. A should take an abstract class of b or an interface that is implemented by b. 

How is this dependency inversion?

We were thinking of three blobs of code, the pizza store, pizza and factory. 
And one of the object relates to the other object in some ways and this relations might be directional. 
Each object or class or say a blob of distinct class abstract or concrete is one blob. But then again it can be resolved into two parts the higher abstract part and the lower concrete part. 

Consider the three blobs, the store, pizza and factory. And then relate them in such a way that. 

store--> pizza --> factory
concrete store --> abstract pizza, concrete pizza --> abstract factory. 

So there are discrete distinct blobs of code and they are

concrete store + abstract pizza
concrete pizza + abstract factory

In this way these blobs are not tightly coupled. That is

store + pizza -->> lightly coupled
pizza + factory --> lightly coupled

Basically if of the two objects, say store and pizza, one or the other were to change, the relation ship wont be affected. 

That again means one another thing and that is that while designing something and you have multiple objects and they somehow relate to one another then even as you are designing the thing and have yet to carve out or smooth out the concrete part of the code or the low level code blocks of objects you would be able to connect them up, low to high, low to high, without worrying about what the lower level implementations would be. 

This is important, there is a sequence here. Even if it might seem to go nowhere. 
#+BEGIN_SRC Java
new store();
mystore.orderpizza(cheese pizza);

#+END_SRC

So far so good. 

Remember we had basically three distinct objects, store, pizza and factory. 

Store to pizza and then to factory. 

I know it is confusing but bear with me. 

New store object;
#+BEGIN_SRC Java
mystore.orderpizza(cheese pizza);

#+END_SRC

Now this is a concrete implementation of a store. This is connected to pizza class, again loosely coupled to pizza object, not to the concrete pizza. 
#+BEGIN_SRC Java
Pizza = creeatepizza(cheese)

#+END_SRC

Now this goes down to some concrete pizza code and this references some high level factory. 

That did not explain it well but the book does seem to and yet I cannot explain it. 

Check out the figure in the page 158

Sorry 156

It is all right but the arrows make no sense. 
Hello

Hello, they forgot to tell us something about the factory pattern, the static keyword, it is there in factory. 

And then the use of the private keyword too. 

These guys are idiots, they should have told us about the static and the private keywords in the factory pattern. 

I kind of understand when you have a static variable but what does it mean to have a static method or class. 



