javanotes.org
** factory pattern : fixed

This is regarding the factory method on which I have been on for the past three days now and it is kind of getting annoying. 

OK so far I understand that factory pattern is just about the following kind of a situation. 

Imagine you have two objects/classes or whatever, one being the client and the other is the creator whi
Ch creates the products. Is that right, I messed up. 

One is the product and the other is the creator. 

Basically two blobs of code. I like to imagine an entire object, regardless of its deconstruction into sub-classes or specialization into interfaces, as a single compact blob. So in the above case the product class and the creator class are two solid blobs. 

Now here is what happens, the client class(this could be another blob) tells the creator class to return some product class objects and the creator class would return the product objects. 

So there is a kind of a relation. 

creator -- >> product

or maybe

client -- creator -- product

So where is the factory?

Factory is very much recognizable block of code, it might not be a whole class, a small function could look like a factory. 

It goes like this
#+BEGIN_CENTER
if blah blah
then return blah blah
else if blah blah
return blah blah
else if blah blah
return blah blah

#+END_CENTER

What that block of code is doing it checking against the passed string arguments and creating a relevant concrete product objects. 

This block of code, or blob of code is the factory pattern. 
You could keep that in the creator class as a method, or you could just pull it out into its own class 
And you could call the class as something like mygoodassfactory

And then stick the method in there. 

That is now the factory class with the factory method inside. 

The problem comes when they talk about factory pattern and abstract factory as different. 

So what is the difference between the two. 

The difference between the two is not really about the factory thing at all. 

What it is about is that the factory class that you created can be again be sub divided into more sub classes. So effectively you have created a super abstract class of factory and the sub-classes or the concrete implementation of factory. 

Basically you took the single blob of factory and divided it into two blobs the abstract blob and the concrete blob or blobs. 

The factory pattern, remember that familiar pattern of
#+BEGIN_CENTER
If blah blah

Then return blah blah

Else blah blah

Return blah blah

#+END_CENTER

This characteristic factory pattern is then shoved into the concrete factory sub-classes. 

Basically by resolving the factory into a separate class and then dividing the factory into abstract su
Per class and concrete sub-classes you have created an abstract factory. 

You can clearly see that abstract factory contains within itself the factory pattern. 

And also that you do not need to have a discrete factory class to have a factory pattern. 

There was too much jargon that was thrown around, like code to an abstraction rather than to an implementation. And such kind of thing. I get it that this is done to sort of insulate two pieces of code with another higher level of code. Now I am not making any kind of sense. There is a way to describe this. 
And still there are other facets left unanswered that is the classes or methods that are supposed to be declared as static or which of them should be private. 

They made a point about dependency inversion wrt the factory method or pattern. 
The thing is they showed two blobs, product and the creator and arrows come flying from creator and congregate at the products. 

So the arrows represent the dependency and if in this case the dependency is linear and unidirectional. 
Now enter factory pattern or rather more accurately factory class (even the pattern works, without the whole class deal_)

In this case the three parts are the creator, factory and the product. Now the arrows go from creator to factory. And from product to factory. And this they call as dependency inversion. At first glance, you could just take them at face value but I cannot really see any kind of inversion. 

All I see is

The creator calls on the factory and the factory then calls or returns the products, they all seem to be unidirectional. 

Remember what I told you about the classes or objects. 

Each of them is to be treated as a single blob of code. Now go ahead and divide each of those three blobs into two parts, the abstract or higher part and the lower part or the implementation part. 

And still the arrows point from

Creator to factory to products

Now the arrows would go in the following fashion. 

Concrete creator to abstract factory to concrete factory to concrete product; or creator low to factory high to factory low to product low. Idk, this is all very sketchy. If the arrows were pointing from low to high, they you can clearly see how the arrows are all pointing towards the abstract factory. This is the inversion in action. 

That junction there, concrete creator to abstract factory ( to concrete factory ) to concrete product. 
Concrete creator to abstract factory to concrete product. 

This is important. For this demarcation between creator and the products is done. So if you were to make changes to products, the code related to the creator block is unaffected and vice versa. You would just need to make some changes additions or deletions to the products and the concrete factory. Creator is left untouched. 



** java keyword: protected : fixed

Weird observation: in java they used the keyword protected on a method, the class is not protected but the method is protected, it might be that a variable could be declared protected. What this means is that the class or method or variable are not visible outside of the package. Idk, I usually use only one package, I have not got the expertise to write something so extensive that more than one package will be required. 


