javanotes.html


<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> singleton pattern : fixed</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Back to java stuff. This is regarding the whole deal with singleton pattern. 
There is nothing more to it, but apart from the code or pieces of code that make it the way it is, it is basically a single blob of object. And this blob of object has the specialty that there is only one instance of it at all times. If you look at the construction of the code you would notice that there are no public constructor for this object, there are no constructor, period. There is one constructor that says, private myclass() and that is it. That is the constructor. 
(there is still doubt about this with me, but we will come back to it later on)
And the code has a special method, and this method is public method, it will return the object the first time and when the function is called again, it would return the preexisting object back, not creating another instance of the object. 
That is how the singleton works. But this is regarding the internals or how the singleton works. We should be more concerned about how to use this singleton pattern. 
</p>

<p>
Singleton pattern:
</p>

<p>
So there is and example that has been given in the book and it goes like this. 
You have a chocolate factory, say this is an object and it has certain methods like draining of the chocolate vat, or filling of the chocolate vat and varied other methods that I am not interested in. There is this objective and that is to write the code in such a way that there is at any time more than one instance of this draining method/ or the object that carries that method. 
So the best solution would be to, I figured why not take that single method that is concerned with drainage and then put it in an object, another object and make that object a singleton. Now you have two objects the chocolate factory and the singleton method that is concerned with the drainage of the chocolate vat. So at any time even if you have multiple instances of the chocolate factory you only have only one instance of the singleton. In this way there would be no danger of accidentally draining the chocolate vat. 
</p>

<p>
Now here is the potential problem, the factory and the chocolate vat are part of the same structure, unless of course you think that the chocolate factory object and the singleton object are two different objects. Think this might not work and since there would be reference or connection between a multiple instance chocolate factory and the singleton class, it would lead to compiler error. This would probably not work. 
</p>

<p>
Now here is another way this could work and that is to make the entire chocolate factory a singleton this means that at any time there is a single chocolate factory object and hence there would be a single instance of the drainage functionality and hence this might work. 
Still another bit to it and that is accounting for multi-threaded applications and in this case the addition of a single keyword fixes it. 
</p>




<p>
Note the relationship between a singleton pattern and the keywords static and private. 
</p>

<p>
Private method or private constructor, so that nobody is able to access the constructor. And then there is the use of the keyword static in the method that returns the object but is not a constructor. 
</p>

<p>
Method that returns the object but is not a constructor. 
Again, what was that. 
</p>

<p>
Nope, this also works as
</p>

<p>
New object, return the created object. 
Same thing over here, new singleton, return the singleton object. 
But prior to doing any of that it would check to see if any other instance is running or not. 
If there is no instance of the singleton
</p>

<p>
or
</p>

<p>
singleton == null
</p>

<p>
Then very well, go ahead and create one and return it but if the contrary then do not create anything but return the existing instance. 
</p>

<p>
Again, the sentence. " no constructor but the method return an object with new" is a bit odd. 
So I am done with the singleton pattern, now for the command pattern. 
Finally we are making some kind of progress. It is is not about the code but rather what is that blob of stuff doing. That is what matters, for instance the factory pattern, and how it is but a specific pattern of code, very easily recognizable and how it could be resolved or written into a separate object and then again how that could be divided into abstract and concrete parts inside which again the pattern would be housed. So that was the factory pattern, the factory object and the abstract factory which is but just a name given to a part of it. 
</p>

<p>
Then we had the singleton pattern, this was just a construct with special keywords but the function of it being to have only one instance of the object. 
</p>
</div>
</div>
