javanotes.org
** command pattern : fixed

In case of the command pattern the following painting has been presented
A set of blobs, or say appliances, the bulb, the radio etc each with their set of dials and switches like the on and off switch or the volume up and volume down switches. 
Now say you have a super blob called appliances or devices and this would contain smaller blobs by the name of radio, bulb, TV and so on. 
Basically this is a single blob. 

Now in case of room we have on and off switch which switch on the lights or switch them off. 

We make an object called the lightsOnCommand. And then we also make another object the volumeUpCommand, this could apply to radio object or the TV object. 

All of these objects would have a common interface, the command interface. 

Now you have two blobs, the appliances blob and the command blob. 
Sorry wrong track, let us back track. 

Two super blobs, the command object and the appliances object. 
LightsOnCommand references a light object. VolumeUpCommand references a radio or TV object. Both these objects, lightsOnCommand and volumeUpCommand have a super higher abstract method called execute. Depending on the individual implementation, execute might call the on method on the object or the volume up method on the object. 

So to summarize. 

At the beginning you have a bunch of appliances with a set of commands. 
Now you take all those commands and put them aside. Now we create another super object called the command object and this is subclassed as commands that do some generic stuff. 
Like commands that turn up the volume, this might apply to radio, TV, and so on. There might be another command that would switch on a light and this might apply to such appliances such as the table lamp the ceiling lamp, the tube-light and so on. 

So till now we have two blobs. 

The lightsOnCommand is constructed in the following way. 
It would accept a light object or object of type light. Again we might have to subclass those objects like tube-light, table-lamp or ceiling light as light objects. 
So all of those objects will be compatible with this type. 
And then there is this command called execute this is an abstract command in the command object that has individual implementations but where. The implementations are there in objects such as the lightsOnCommand, there is one implementation, for the volumeUpCommand there is another implementation. 
This will need to be diagrammed. 

There is a small piece of confusion in here and that is as follows. The kind of appliance objects that you have used are too varied. Let us make them sort of homogeneous. 
Say the appliances in question are like garage doors, building doors, house doors, barn doors, house windows and so on. 

So all of them have this common function that is the doorOpen function. 
Now I do not want to manually create these objects and then execute that function for them. I want a kind of a wrapper that would take those objects as arguments and then press those buttons or execute those functions for them. 

So there is an generic object called the doorOpenObject and this guy takes all of those types of objects and then internally it would have a function called execute which would pass the type of the object to it and then do the relevant actions. In this case the relevant action would be
#+BEGIN_SRC Java
execute(object object){
this.object =object;
object.doorOpen();

#+END_SRC

that is the function.


So basically you have to create the house door and then create a doorOpenFunction object and do
DoorOpenFunction. Execute(house door object); or doorOpenFunction. Execute(building door object); and all that it would do is open the door. 
So this is the command pattern. 

When you have a bunch of objects with similar kind of methods and you do want to delegate the function of pressing those buttons or executing those functions to another object, in this case that guy to whom this task is outsourced is called the command object. Just an ordinary object having a higher abstract generic function called the execute function that does some kind of generic action, like open the door. 

This needs more polishing and explaining. 

You could take this further more, say you have the appliance objects and since they are all under the umbrella of the same interface object or abstract class, you could add them into a list or array-list. 
You could then loop through this list and then on each item of the list execute the command pattern object, so on each object the execute function is operated on. 
You could further extend this, you could make a command called the lightsOffCommand object and then a volumeUpcommand object and so on. 

This could kind of get messy in the following way. You would have a multitude of appliances that would be like the radio TV and so on and then there would be the lights based objects like the table lamp the ceiling lamp etc and other type of appliances, you could group them as the following the radio appliances which would be the super abstract group which would contain those objects and then you would have the light based appliances which would be the super abstract group which would then contain the objects like  table lamp or whatever. 

So there is a single stage of branching. You cannot put a super class on top of radio based and light based object classes but you could make them implement a common interface, that way all the appliances will have a common type. 

Wish I could make this simpler, the thing is this is not a simple thing. Basically what has been done i
S that they have taken a simple stuff and then made it complicated. 
Let us do a very simple example. 

Say you have a fan object and that fan has a on method. 
#+BEGIN_SRC Java
New fan; fan. On(); this is the simple stuff. 

complicatedExtraneousObject;

complicatedExtraneousObject.execute(fan object);

#+END_SRC

Basically you bought a fan and this came with a fancy switch. 
But you are a lazy person, so you bought another object that has the sole purpose of pressing the buttons of any object that is passed to it. 
That is the command pattern. 


