javanotes.org
** adapter pattern : fixed

This will be about the adapter pattern. So here it is. The thing is that in this case, you have two objects like two proper blobs of code. And they are of different types OK, this is because they are different objects and there is no intervening or common interfaces. 

But then you want to say aggregate the dissimilar objects together in a list, like an array-list. 
Now this cannot be done for they are of different types and there is no common interfaces between then. 
Here comes adapter pattern to the rescue. This is an extra blob of code, an object that will be like a bridge between the two original blobs, say a and b. So a and b will be bridged by this adapter. 
This adapter blob will implement blob a and will reference blob b. Let that sink in. 

It is kind of like standing between the two blobs a and b and is kind of like holding both their hands. 
Implementing one and referencing the other. 

The object that it is referencing is taken as argument in the constructor and internally it has assignment to the referenced objects. 

Well I was looking for the new keyword inside the class. A class which is not the main but rather the definition or the template of an object will never have a keyword, new. You will find new keyword in the main block. 

So that is that. 

So if you have two separate objects unrelated even by interfaces, say a and b. And if you wanted to group them in a list but could not due to the differences in type, you can do so now. 
You have to invent another blob and this blob sits between the blob a and b, implements one of them and internally references the other and takes the other object as argument and internally assigns that to the referenced object. 
Finally you can have a list of objects of both a and b types. 

Conclusion is that: if you thought that you could only list object of a certain type, if not by class supertype or abstract type then by the interface type. 
Wrong

You can also group together objects of types that are not the same and even if they do not have a common interface. 
Now that you think about it, this can be done for all sorts of objects however dissimilar they might be. 

This might work as follows, 
Create a object, create b object now pass b as argument to the adapter object and assign to a variable. Take a and converted b and put them in a list. 




** factory pattern :fixed

So moving on with the whole java thing. 

So far covered, the factory method and this includes the factory pattern and the abstract factory. Why is it the factory method, should it not be factory pattern. 

There after we have the singleton pattern. 

What I am trying to do is try to explain things in my own terms, like I clump together all the interfaces or the classes and the sub-classes into a single blob. And that makes it easier to comprehend all of these patterns. 

The adapter pattern. 

Factory: originally you have two blobs but then you invent a third blob as a go between. 

Singleton: you had a single blob, but then you modify the code with some keywords. 

Adapter: you had two blobs but then you invent a third blob as a go between. 

Command: original single blob but then you invent another blob to execute the functions of first blob. 


** decorator pattern : fixed

Decorator pattern: can I make this simpler. 

This is a single big blog, a dog chasing its own tail or a snake devouring its own rear end. 
All of it is a single blob or under the same big class. 
In the sub-classing department too, there is more than a single stage of branching. 

Let us consider two big blobs. One is the core_beverage and the other is the beverage_decorator and both of them are abstract and are subtended by a super blob called beverage. All of this the bifurcation or triangle are abstract. 

Now for the concretes. The core_beverage can be tea or coffee object. 
And the beverage_decorator could be milk object or sugar object. 

Classes abstract or otherwise have methods or functions. The super abstract class has a method description and another method cost. 

This is inherited by all of the sub-classes. So the tea, coffee object as well as the milk and sugar object have this function or method. 

In the sub-classes the concrete sub-classes, these methods need to be overridden to return custom description and cost. 

The beverage decorator is abstract class and it is there just for the sake of collecting all those concrete objects under the same umbrella, never mind that it is mostly empty. Just an empty blob that sub-classes other concrete blobs, even if it itself is mostly empty. 

Just like an empty or mostly empty blob that branches into multiple blobs loaded with functions. 
The majority of the actual code that does most of the work is itself concentrated in the decorator concrete classes. 

It would be better if we were to treat this as the case of two blobs. The core blobs and the blobs that have the wraparound capability that is to accept another blob as argument. This blob that is taken as argument might also be a composite. The blob that takes a composite blob does not worry about what it is accepting, it only sees the blob that is the outermost. The inner blobs are hidden from the wrapping blob. 



The twist being that these two core blob and wrapping blob are differentiated from each other by immediate super abstract blob and then again they are made to be of common types by yet another super super abstract blob. 

So for decorator you really start with two types of blob, the core blob and the wraparound blob. The wraparound blob can take the core blob as well as wraparound blob as arguments. 


