javanotes.html


<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> adapter pattern : fixed</h3>
<div class="outline-text-3" id="text-1-11">
<p>
This will be about the adapter pattern. So here it is. The thing is that in this case, you have two objects like two proper blobs of code. And they are of different types OK, this is because they are different objects and there is no intervening or common interfaces. 
</p>

<p>
But then you want to say aggregate the dissimilar objects together in a list, like an array-list. 
Now this cannot be done for they are of different types and there is no common interfaces between then. 
Here comes adapter pattern to the rescue. This is an extra blob of code, an object that will be like a bridge between the two original blobs, say a and b. So a and b will be bridged by this adapter. 
This adapter blob will implement blob a and will reference blob b. Let that sink in. 
</p>

<p>
It is kind of like standing between the two blobs a and b and is kind of like holding both their hands. 
Implementing one and referencing the other. 
</p>

<p>
The object that it is referencing is taken as argument in the constructor and internally it has assignment to the referenced objects. 
</p>

<p>
Well I was looking for the new keyword inside the class. A class which is not the main but rather the definition or the template of an object will never have a keyword, new. You will find new keyword in the main block. 
</p>

<p>
So that is that. 
</p>

<p>
So if you have two separate objects unrelated even by interfaces, say a and b. And if you wanted to group them in a list but could not due to the differences in type, you can do so now. 
You have to invent another blob and this blob sits between the blob a and b, implements one of them and internally references the other and takes the other object as argument and internally assigns that to the referenced object. 
Finally you can have a list of objects of both a and b types. 
</p>

<p>
Conclusion is that: if you thought that you could only list object of a certain type, if not by class supertype or abstract type then by the interface type. 
Wrong
</p>

<p>
You can also group together objects of types that are not the same and even if they do not have a common interface. 
Now that you think about it, this can be done for all sorts of objects however dissimilar they might be. 
</p>

<p>
This might work as follows, 
Create a object, create b object now pass b as argument to the adapter object and assign to a variable. Take a and converted b and put them in a list. 
</p>
</div>
</div>




<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> factory pattern :fixed</h3>
<div class="outline-text-3" id="text-1-12">
<p>
So moving on with the whole java thing. 
</p>

<p>
So far covered, the factory method and this includes the factory pattern and the abstract factory. Why is it the factory method, should it not be factory pattern. 
</p>

<p>
There after we have the singleton pattern. 
</p>

<p>
What I am trying to do is try to explain things in my own terms, like I clump together all the interfaces or the classes and the sub-classes into a single blob. And that makes it easier to comprehend all of these patterns. 
</p>

<p>
The adapter pattern. 
</p>

<p>
Factory: originally you have two blobs but then you invent a third blob as a go between. 
</p>

<p>
Singleton: you had a single blob, but then you modify the code with some keywords. 
</p>

<p>
Adapter: you had two blobs but then you invent a third blob as a go between. 
</p>

<p>
Command: original single blob but then you invent another blob to execute the functions of first blob. 
</p>
</div>
</div>


<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> decorator pattern : fixed</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Decorator pattern: can I make this simpler. 
</p>

<p>
This is a single big blog, a dog chasing its own tail or a snake devouring its own rear end. 
All of it is a single blob or under the same big class. 
In the sub-classing department too, there is more than a single stage of branching. 
</p>

<p>
Let us consider two big blobs. One is the core<sub>beverage</sub> and the other is the beverage<sub>decorator</sub> and both of them are abstract and are subtended by a super blob called beverage. All of this the bifurcation or triangle are abstract. 
</p>

<p>
Now for the concretes. The core<sub>beverage</sub> can be tea or coffee object. 
And the beverage<sub>decorator</sub> could be milk object or sugar object. 
</p>

<p>
Classes abstract or otherwise have methods or functions. The super abstract class has a method description and another method cost. 
</p>

<p>
This is inherited by all of the sub-classes. So the tea, coffee object as well as the milk and sugar object have this function or method. 
</p>

<p>
In the sub-classes the concrete sub-classes, these methods need to be overridden to return custom description and cost. 
</p>

<p>
The beverage decorator is abstract class and it is there just for the sake of collecting all those concrete objects under the same umbrella, never mind that it is mostly empty. Just an empty blob that sub-classes other concrete blobs, even if it itself is mostly empty. 
</p>

<p>
Just like an empty or mostly empty blob that branches into multiple blobs loaded with functions. 
The majority of the actual code that does most of the work is itself concentrated in the decorator concrete classes. 
</p>

<p>
It would be better if we were to treat this as the case of two blobs. The core blobs and the blobs that have the wraparound capability that is to accept another blob as argument. This blob that is taken as argument might also be a composite. The blob that takes a composite blob does not worry about what it is accepting, it only sees the blob that is the outermost. The inner blobs are hidden from the wrapping blob. 
</p>



<p>
The twist being that these two core blob and wrapping blob are differentiated from each other by immediate super abstract blob and then again they are made to be of common types by yet another super super abstract blob. 
</p>

<p>
So for decorator you really start with two types of blob, the core blob and the wraparound blob. The wraparound blob can take the core blob as well as wraparound blob as arguments. 
</p>
</div>
</div>
