javanotes.org
** template pattern : fixed
#+BEGIN_SRC Java
duck duck;
if (blah)
duck duck1 = new dododuck;
else if (blah blah)
duck duck2 = new fododuck;
etc

#+END_SRC

Here is something that is being called as the template pattern. Given two well defined blob but then they do have similarities and then we do something like follows. 

Say for example you have tea and coffee and since they are both caffeine based beverages, we could like make their recipe and since that thing has similar components we could then maybe put then in a way that what is left in the concrete coffee or concrete tea is the very minimum. All of the common components we shove then up the abstract super classes which are anyways abstract, they have to be abstract. 

What cannot be put in the higher super classes and has to be put in the lower concrete classes has to be declared as abstract in the higher classes. This is wrong. Example brew() and condiment() these are common in tea and coffee but internally or their implementation is totally different so they are defined in the concrete sub classes but put in the higher abstract classes due to the common name but then declared as abstract and obviously left to the implementation below. 

Basically what they did was take two sort of like a well defined blob and then since in both cases or in case of any blob which can be divided vertically into abstract and implementation and since we do this for both the blobs, we can see components that might be common to both of them, the upper part of the blob or the abstract blobs can be unified into a single blob. And we strive to make the upper abstract or commanded blog as big as possible and the lower implementation blob as small as possible. 

This is being called as the template pattern, what we have done is taken two blobs and in each case divided vertically and then encapsulate what was in the upper part of the blob as a common plan or a common template and the lower part of the blob as the bare minimum unique implementation. 


Template pattern: take two blobs, divide vertically and see if there is similarities, if there are similarities commonify them, or template them. Make the upper blobs bigger and bigger and the lower unique implementation blob smaller and smaller. 

Here is more on this. 
Take a blob, any blob, it is obviously divided into two parts, the abstract sub blob and the concrete sub blob. Try to make the abstract sub blob bigger and the concrete sub blob smaller. Also make the abstract sub blob drive the entire blob rather than the concrete sub blob. The abstract sub blob should be in charge, not the concrete sub blob. 

This is idiotic enough. 
So how do you start with the application of the pattern business. 
In each case regardless of the pattern thing, you have the individual objects to which the functions are relegated or delegated but then you can take that as a blob, a mass of dough really and after kneading it to soft smooth ball, you can then divide it into two bits, the abstract bit and the concrete bit. This is regardless of the big picture or what pattern is being implemented. 

So this is my thinking, that you start with your usual functions and then you tie them up with objects and you determine as to how many objects you would be needing and then you divide the objects vertically. Now stand back and look and see what pattern can be implemented on it, and you might need to invent fictitious other objects or blobs, like in the case of factory or adapter etc. 


Update about the template pattern. This has to do with a single blob, you have in this undivided blob. A set of steps, like func1 func2 func3 till funcn. What they have done is take that and then put it inside a big method called the recipe and put all those functions in there. Now you put this big composite method and put it in the head part of the now vertically divided blob. So that the super abstract part will have this composite method with the serial functions. The implementation of those functions will get distributed between the abstract super part and the concrete part, depending on common components of the different blobs of the bigger picture, depending on how many blobs you are dealing with like maybe coffee blob and then tea blob and so on. 

So the thing is that the defining part is the composite function blob in the head part of the blob. 
Regarding hooks: you have the single blob, which you divide into two blobs the abstract and the concrete blobs. 

So you might have a function and there might be two versions of it. Either can be triggered at run time. 

You put one implementation in the abstract super part and another implementation in the concrete part. 
And if this were the template, you could, scratch that, forget any reference to template. 

In either of the blobs that is vertically, you have this composite function that is basically a recipe, 
 it would say something like

func1; func2; func3; ... funcn;

One of them func is implemented both in the super abstract part and the concrete part. 
And in that composite function, the recipe will go like follows

func1, func2, func3, if some Boolean then func4; func5; func6; ... funcn;

That func4 has an implementation in the abstract head part and another implementation in the concrete part. 

This will be triggered by user input of some Boolean. 
If Boolean then trigger the implementation of func4 in the head part; else something else will happen. 

The composite function could go like this

#+BEGIN_QUOTE
func1; func2; func3; if Boolean func4 or else func5; func6; .... funcn;

#+END_QUOTE



Is this the hook. 

Sorry, another attempt at explanation. 

The composite function would look like

#+BEGIN_QUOTE
func1; func2; func3; if myboolean() then func4 else func5; func6; .... funcn;
plus a default value for the myboolean() is supplied in the abstract part.

myboolean(){ return true}

this myboolean() can be overridden in the concrete part/ by user input.

#+END_QUOTE





So there are two of these
#+BEGIN_QUOTE
myboolean() in the head part with the default implementation
and myboolean() in the concrete part with the alternative implementation.

myboolean(){return true as default}
myboolean(){ take user input as Boolean and return that}

#+END_QUOTE

As far as hooks go, there are three parts to it, two of the implementations are there one is the default and the other triggered by the specific Boolean. 

And then the third part is the conditional block that will trigger the hook. This is included in the recipe. 


The Hollywood principle or pattern, don't call us we will call you. 
They talk about high level and low level, which is high and which is low. 

When we look vertically, we would see that the higher abstract part of the blob is the higher part. 
And the concrete bits are the lower part. 

Ideal: the higher bits should be in control, not the lower bits. 
The higher bits should call the shots, not the lower bits. 

Who depends upon whom. 

Ideally: the lower bits should depend on the higher bits. The higher bits are in control, they should not depend on the lower bits. 
Looking back in the template pattern, which concerned a single blob, divided into two traditional, high and low blobs. 

The template pattern or the recipe thing is not in the concrete part but in the abstract higher part, so the higher abstract blob is in control, not the lower concrete part. 

Hollywood pattern: if you have divided a single blob into two, the high and the low, place the recipe or the method calling all other methods in the higher abstract part. 

Contrast the Hollywood pattern with the dependency inversion. 

Did they use dependency inversion in factory. 
Factory: given two blobs where one blob creates the other blobs, create a third blob as a go between, so the original two blobs become untangled from each other. 

Consider original two blobs. 

#+BEGIN_QUOTE
blob1 and blob2;
now we invent a third blob, blob3.
blob3 calls or creates blob2;
blob2 depends on blob3;
blob3 is called upon by blob1;
blob3 depends on blob1;
blob1 blob3 blob2
blob1 calls blob3 calls blob2

#+END_QUOTE

Is it really?

Remember in the factory, the two blobs, the concrete bits have the factory pattern. 

This is confusing
#+BEGIN_QUOTE
Blob2 depends on blob3; blob3 depends on blob1; blob1---->blob3<----blob2; this makes sense. But what makes you think that blob1 is higher in hierarchy than blob2; or maybe that is not the issue here. 

#+END_QUOTE

That does makes sense
#+BEGIN_CENTER
blob1---> blob3<--- blob2

#+END_CENTER

Whereas in case of Hollywood principle, the dependency thing is within a single blob
#+BEGIN_QUOTE
blob == blob_abstract + blob_concrete;

blob_abstract --->  blob_concrete; (the Hollywood principle)

#+END_QUOTE

More confusion, 

Given blob1 blob2 and blobf for factory blob. 

blob2 depends on blobf or blobf <--- blob2; blob1 does not depend on blobf or blobf ---> blob1; or blob1 <--- blobf --- blob2

blob1 <--- blobf <--- blob2; inside blobf blob-abstract depend on blob-concrete or blob-abstract ---> blob-concrete;    blob1 <--- blobf-abstract ---> blobf-concrete <--- blob2; is this what they are trying to tell us.

With hollywood principle, blob-abstract <--- blob-concrete and not blob-abstract ---> blob-concrete. 

What could be the use of Hollywood principle or pattern. Blob-abstract <--- blob-concrete. The abstract bit could have all the hooks, well within the template. 

So the different patterns or methods so far. 

The hook pattern was kind of like contained in the template pattern. And this was more or less related to the Hollywood pattern. So it is like the template, the Hollywood or the hook all pertain to a single blob. 

So you could have three blobs as in factory, with original two blobs and the third factory blob. Barring the factory blob the other two blobs could incorporate the template or Hollywood pattern and might also contain hooks. 

What are your thoughts about the similarity between the factory and the adapter patterns. 

How to warm-up for a sit-up or push-ups?

Interface comparable and method compareTo(); interface comparable seems to be a system library. 

So you have objects, blobs and we would want to put them in an array. You want to compare anything that is in an array. 

And you want to sort them. 

So you build your blob with the following way
#+BEGIN_QUOTE
myblob implements comparable(){ blah blah}

and inside it you have to define your compareTo() method.

compareTo(blob otherblob){if thisblob > otherblob or thisblob==otherblob or thisblob < otherblob}

#+END_QUOTE

idk,

int compareTo(blob otherblob){thisblob > otherblob, return 1; thisblob < otherblbo return -1; thisblob == otherblob , return 0}

Or maybe the return type could be string


string compareTo(blob otherblob){thisblob >  otherblob, return "more"; thisblob < otherblob, return "less", thisblob == otherblob, return "equal"}

Since the interface comparable is a system one, the methods therein are all defined inside and are not really something that you bother with, it has the method sort and everything. So you just use them. They are defined as static, (i have no idea what that means). It says you have to use it in the following way

array.sort(myarray object).

That is it. 


And how is this a template pattern, I cannot see a template pattern in there. 

Is it because in the class def, there is the compareTo() method which goes like if blah then blah, els
Eif blah then blah and so on. 

Idk

This is nice, the blob might be called duck but we will name the array object as ducks;

The blob might be called bus but we will call the array object as buses;

Bird, birds; car, cars; plane, planes; etc

This chapter is more confusing then enlightening. 

Gobbledygook: strategy pattern uses object composition; what the hell is object composition. 

Very inadequate cursory glance at Jframe stuff. What the hell is it. It just shows a glimpse and some gobbledygook and exit. 

You wanna see page 357 for this, jframe thingy. 

Not much to see. 

For applets there is page 358, make whatever that you want to make of it. There is just not enough examples provided. 

Get an overview of template and strategy and come back to this page, 359. 

What is object composition vis a vis strategy pattern. 

I forget, what was the difference between array and array-list

This one is difficult, there is the so called iterator thing. You can build one yourself, example given, and it is ugly or use one of the library provided one. Much hassle avoided. 

I have not digested as to what just happened but then I see components that make sense and then there are some that do not. Of the ones that do make sense are the broad ones like I see there are objects and then I see that they are creating object with new and then putting them in list like structures and then cryptically they are looping through the lists. 

Did you see any of the previous examples of patterns. They all seemed very straightforward. 

Two blobs being taken in by another blob. This is not a factory or no template or whatever. No singleton. This is just plain old mush. 

Those uml diagrams, I hate those, they just make the simple things more complicated. 
At this stage we should probably take a look at all those list structures and how to loop through them. 
Get some understanding and build our own understanding of it. 


