javanotes.org
** thinking about java oop : fixed

The thing is that when you are writing code and you are like you have all the components in the form of different classes and interfaces and you have sorted them into packages and which is anyway a sort of an afterthought and the public private and all that sort anyway is an afterthought anyway. The thing is that when all of this is done by anyone it is perfectly understandable or legible and it is all right, you put them into the respective packages or folders and zip or whatever and all it a jar file or whatever. 

The thing is that the person who later on will have a look a the source file and will see a smattering of file laying around in random directories there is no overview of the whole thing or how the thing works, there is no such kind of documentation or is there. 

I will have to look into this. But the thing is I have devised or really thought about an approach that might work. 

It goes like, you have a bunch of files, like java files in a bunch of directories(thank god there is not h and c files like in c) now you open a file and see the main constructor in that file and not that class and the constructor and how or what kind of args that it might be taking. Not that important, we just need the name of the class. Now we close that file and open another file and repeat the same procedure. 

Now we list all of those class names and we create a dependency map on a piece of paper, which one depends on whom and all this time you do not really need to get too hung up on the whole methods or functions thing. 

That should be it and just ignore the whole packages hierarchy deal. This will just do, this is what you are thought to recognize. And we just did that. 

Same kind of approach could be done in case of the c++ code but then I do not really have too much of understanding in that language. The only complication that you might run into the h files I guess. Idk what is the deal with all those h files anyway, the same kind of approach will suffice I guess, you jut down the names of the class and then you try to diagram or draw the relation Edwin them neglecting the many functions, only listing the important functions, the rest are not required. 



