javanotes.html



<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> treating collection objects in java as boxes ??</h3>
<div class="outline-text-3" id="text-1-16">
<p>
Now back to java stuff. 
</p>

<p>
There are always the so called collections like you have a  a list or something like that, you have the o called arrays or arraylists and what do you have, the hashtables or it is the hashlist thing. I will explain later as soon as I figure out what is really is or how does it differs from the array-lists. 
</p>

<p>
Now I want you to imagine a matchbox, there is this matchbox, a simple matchbox filled with matchsticks. Now regarding the box, it is a single unit not a two units like the box cover itself and the sliding box inside, bot of these are the same one unit. So basically the matchbox and the matchstick are two units like the box and the sticks. The sticks are one object and you have it defined with a class. Similarly the box it self is another object that you define with a class. 
</p>

<p>
The box is a class or an object that inside has this collection like maybe an array or array-list or whatever, we really do not care about the specific nature of it, so long as it is it a collection. So far so good. 
</p>

<p>
In this collection that is the box we put in all those other objects, the sticks. 
</p>

<p>
That is quite nice picture. 
</p>

<p>
Now in the olden days to iterate over this collection, it was a simple for loop but in case of java, unlike other languages it is or seemingly more complicated, it looks complicated to me. But now there is no more worry for you can do way will all of that kind of chore. For now you just have to implement this particular interface and it would provide you with just two simple methods that you invoke like so
Array. This awesomemehtod(your object here)
</p>

<p>
And presto you have magic. That is so nice. 
</p>

<p>
And it works across all those myriad types of collections, you do not have to write variations of for loop methods for each of the collections. And this is a big win. 
</p>

<p>
A simple matchbox filled with sticks and it just has to implement this interface and those two or three methods become available for our use. Just like that. 
</p>

<p>
One question remains though, who is to implement that interface the box or the sticks. 
</p>

<p>
java , look at page 398
</p>


<div class="org-src-container">

<pre class="src src-Java">for files in myfiles; do blah blah
for (type object in collection) do blah blah
for (type object: collection) do blah blah
for (type object: myarraylist) do blah blah
</pre>
</div>





<p>
Iterator pattern got more complicated. 
</p>

<p>
First there were two objects, the dinerhousemenu and the pancakehousemenu. And we have created a waitress object. 
</p>

<p>
So there are three objects in total, waitress object, dinerhouse menu object and pancakehouse menu object. Three blobs in total. 
</p>

<p>
What does the dinerhouse menu object or the pancakehouse menu object contain. 
</p>



<p>
Pancakehouse menu objects and the dinerhouse menu object has collections, consider the image of match sticks packed inside a match box. Pancakehouse menu object is a matchstick box such that in the class itself they have defined the various matchsticks and then later proceeded to pack those sticks inside the box. 
</p>

<p>
Let us consider that all over again. 
</p>

<p>
Start with the original objects, the dinermenu object and the pancakehousemenu object. 
Dinermenu or the pancakehousemenu objects are collections. 
They are collections in the sense that they have the collections like array or array-list and they populate those collections as well. 
</p>

<p>
Waitress is an object that takes as argument the dinermenu and the pancakemenu objects (collections) as arguments. 
</p>

<p>
The answer to all your confusion is the java. Util. Iterator
What is this anyway. 
</p>

<p>
There are different types of collections and since they are different, the many methods that are used to iterate through them would be different, like if you were to for loop through two different type of collection, the implementation of those methods would be different. You need some common, uniform kind of functions or methods to get through all of the different kind of collections. 
</p>

<p>
What I was hoping for was something completely different. Like if you have some kind of objects which is a collection type then, you could just slap to it some function like the for loop function (obviously this means that the class of that object has to extend some hidden system class or library). 
</p>

<p>
Like say we have some collection objects, 
</p>

<p>
Myobject1, myobject2, where say myobject1 is a hashtable kind of collection and the myobject2 is a array type of collection.
 So I wanted it to be like
</p>

<div class="org-src-container">

<pre class="src src-java">Myobject1. For_loop_through_this() ;; &lt;-- this sort of thing does not exist.
</pre>
</div>

<p>
There is however an interface a big hidden interface called the iterator that towers or presides over all the different type of collections or rather you have to manually implement that interface in your class definitions. 
</p>

<p>
As we all know the interfaces only have the declarations of the different functions and no implementations. So you have those hasnext() or next() but there is no implementation. 
</p>

<p>
Really, I expected more from interfaces, what is the use of interfaces if they are just empty shells. 
</p>

<p>
Originally you had two objects, the dinermenu object and the pancakemenu object. You make another class, this guy generates iterators from whatever collection is passed to it. 
</p>

<p>
Nope, not a single class but two separate classes, one for each of the menu kinds/ or collection types
Dinermenu object, dinermenu-iterator object and for the pancakemenu object we have the pancakemenu-iterator. 
</p>

<p>
Dinermenu-iterator and pancakemenu-iterator can be visualized as empty shells into which you are passing the two objects, dinermenu and pancakemenu. So these are basically collections, array or array-list. And these dinermenu-iterator and pancakemenu-iterator take these collections as arguments and internally they deal with the collections by means of defining functions or methods that were already described in the interface iterator. These basically have the implementations of the methods hasNext() or next() and remove() and so on. 
</p>

<p>
Waitress object takes as argument these two objects / collection objects and internally creates the two iterators
</p>

<div class="org-src-container">

<pre class="src src-java">New dinermenu_iterator(dinermenu which was passed as argument)
New pancakemenu_iterator(pancakemenu object);
</pre>
</div>

<p>
Now the waitress can deal with or work with these two iterators, like display stuff from the two collections or doing stuff to the collection. 
</p>

<p>
Only problem with this :
</p>

<p>
Started with two object / collection types/ there could have been more than two. And we had the waitress object. Had to create two more classes, iterator classes for each collection type. So the waitress object internally creates the iterator objects. 
</p>

<p>
For each collection type, you would create an extra blob that deals with that collection type blob. Kind of like wrapper stuff. 
</p>

<p>
Almost like collection type object deals with waitress object. 
</p>

<p>
Now you create an iterator object as an intermediary. 
</p>

<p>
So the iterator object sits between collection type object and the waitress object. 
</p>

<p>
The one thing that they could have helped with is the bit about the intermediary classes, the iterator classes. You do realize that the whole iterator classes are kind of like sham, just empty shells that you could have put in copy pasted code to implementation of the next(), hasNext() functions. And maybe that is where the power of the iterator classes lie, they are empty shell, a wrapper, it could just have been some copy pasted code. 
</p>

<p>
So at the end it looks like follows. 
</p>

<p>
The classes that contain the collections and then they are passed to the object (in this case waitress) to deal with them. That is where and how the dealing between waitress and the different object is modified. The iterator is taken out of the waitress and put out into an external object. 
This sums up the iterator object. 
</p>

<p>
Something seems to have changed. 
</p>

<p>
You had original two items, dinermenu object and pancakehousemenu object, these are both collections. They have to work with waitress object. 
</p>

<p>
Place dinermenu object and pancakemenu object blobs under a superblob called menu (an interface). This superinterface has a method, create-iterator(). 
</p>

<p>
How does create-iterator() works. It just wraps around the collection object and the method iterator(),  which is the library method. Which you can apply since all kind of collections fall under that superclass or super interface anyway. 
</p>

<p>
How does create-iterator() works. It just wraps around the collection object and the iterator() function. 
</p>

<p>
Basically
</p>

<div class="org-src-container">

<pre class="src src-java">this_collection_object.return_menu().iterator(); this is returned
</pre>
</div>

<p>
remember i had to make fictious or placeholder classes for each of the collection type and then place the implementations there. (do i still need that)
</p>
<div class="org-src-container">

<pre class="src src-java">class dinermenu_iterator( dinermenu object){

all the implementations of next() or isNext() and so on}

collections object, dinermenu object; dinermenu.return_values().iterator() ; &lt;-- wrapped around in collections.create_iterator();

collections_object.return_values().iterator(); &lt;-- from collections_object.create_iterator();
</pre>
</div>

<p>
Does this mean I do not need to implement those iterator stuff next() hasNext() and so on. (the book is not very clear about this)
</p>

<p>
Search these terms: java collections framework. 
Classes that are part of java collections framework
</p>
</div>
</div>
