javanotes.html


<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> iterator pattern: waitress object fixed</h3>
<div class="outline-text-3" id="text-1-17">
<p>
The waitress object has these new tools
</p>

<div class="org-src-container">

<pre class="src src-java">iterator dinermenu_iterator = new ???? ; &lt;--- going up the wrong tree, there is no new. no constructor?
iterator dinermenu_iterator = dinermenu.create_iterator(); &lt;--- this is the way to do it.
</pre>
</div>

<p>
The type iterator, has all the fancy methods, next(), hasNext() and many others.
</p>
<div class="org-src-container">

<pre class="src src-java">iterator arraylist_collection_object_iterator = arraylist_collection_object.create_iterator();

iterator array_collections_object_iterator = array_collections_object.create_iterator();
iterator hashtable_collections_object_iterator = hashtable_collections_object.create_iterator();
</pre>
</div>



<p>
The waitress uses the generic iterator type, and does not need to provide individually for each type of collections object. 
</p>

<p>
The composite pattern: this is something that was built to relieve one deficiency of the iterator pattern. 
</p>

<p>
Iterator pattern: you have objects that are really collections like hashmap or arraylist and arrays etc. 
</p>

<p>
The iterator pattern allows for creation of a superblob and into this blob we add the other blobs like the collection object blobs. All the collection object blobs go under this superblob. And this superblob has this createiterator() function. 
</p>

<p>
What this pattern allows us to do is to do the following. 
</p>

<p>
All the blobs, the collection blobs will extend an interface. So they are of the same type. So a similar type of an iterator. 
</p>
</div>
</div>


<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> composite pattern fixed</h3>
<div class="outline-text-3" id="text-1-18">
<p>
Move over this. Now we have the composite pattern. 
</p>

<p>
Given different collection objects, now we will make a super collection object and all those collection objects inside the super collection object. It might be an array of arraylists, hashtables, arrays etc. 
Now we have to add all these blobs into a blob which is then fed to the waitress. 
</p>

<p>
All the composition blobs used to make a superblob, usually an array object or arraylist object, now add this bigger array or arraylist object into another blob which is then fed to the waitress. 
</p>

<p>
The structure of this blob, which is different from the blob used in iterator pattern is interesting, so interesting that I am having difficulty understanding it. 
</p>

<p>
In the previous case, the iterator pattern case, you were adding the collections object directly. 
</p>

<p>
In the composite pattern case you will make a composite of all the collections object given and then add it to the blob. 
</p>

<p>
The blob has the ability to identify nodes and leafs and it knows when it is a composite, or it can traverse the complex tree structure that is passed to it. 
</p>

<div class="org-src-container">

<pre class="src src-java">iterator pattern case would look like the following.
waitress(big_blob(blob1, blob2, blob3))

composite pattern would look like
waitress(big_blob(composite_blob(blob1, blob2, blob3)))
</pre>
</div>

<p>
We can clearly see that the big<sub>blob</sub> has to deal with the composite<sub>blob</sub>, that is the big<sub>blob</sub> has to k
Now how to traverse the tree structure of the composite<sub>blob</sub>. 
</p>


<p>
The benefit in either case being that, given that waitress and the collection blobs are at the extreme end  of the spectrum, we want them to be independent of each other, hence the intervening structures or blobs. 
</p>

<p>
Making the waitress and the composition objects as independent as possible is made by the composite pattern. In iterator pattern you have to open up waitress each time you make changes to the composition object, whereas in the composite pattern that has been taken care of. 
</p>

<div class="org-src-container">

<pre class="src src-java">waitress(big_blob(composite_blob(blob1, blob2, blob3)));
</pre>
</div>
<p>
on this composite pattern i got some more ideas
</p>


<p>
yeah regarding the composite patern
</p>
<div class="org-src-container">

<pre class="src src-java">waitress(big_blob(composite_blob(blob1, blob2, blob3....)));
</pre>
</div>

<p>
The most complicated part in this would be the big<sub>blob</sub>
</p>

<p>
This big<sub>blob</sub> is not really a single object but you might say that it is two objects. But still you have to call it a single object. This is confusing and why is this. 
</p>

<p>
One: big<sub>blob</sub> made of super abstract class which is subtended by or extended by two concrete classes, still not sure as to what they really do. But if I may risk a guess, one of them takes the composite object as argument, and what about the other, nope, I am not very sure as to what these two objects are doing. But even if I do not know the function of the said object. It is clear from the context or the picture that the two objects are horizontally related. Hold it now, are you sure. 
</p>

<div class="org-src-container">

<pre class="src src-java">super_abstract_class(concrete_class1, concrete_class2);
we will make to more weird.
super_abstract_class(concrete_class1, concrete_class2(super_abstract_class));
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> the back curving arrow fixed</h3>
<div class="outline-text-3" id="text-1-19">
<p>
See, the top node is related to one of the branches, you might say there is a horizontal relationship. 
In the uml or diagram thing the top or super abstract<sub>class</sub> subtended two concrete classes and it was shown by arrows, like it is normally done but one of the arrows branches back onto the parent abstract class. &lt;&#x2013; see the above condition. 
</p>

<p>
Parent node related to one of the branches. 
Parent node has a horizontal relationship with one of the subclasses. 
</p>

<p>
This kind of curving arrow was encountered before too but then I did not catch on that. 
</p>

<p>
The thing is that there is a way to name this kind of relationship. 
Idk, what would you call it. 
On the other hand, I have till now maintained a strict separation of the vertical relationship versus the horizontal relationship. 
In the following
</p>

<div class="org-src-container">

<pre class="src src-java">waitress(big_blob(composite_blob(blob1, blob2....)));
</pre>
</div>

<p>
We can say that there is a horizontal relationship between waitress, big<sub>blob</sub>, composite<sub>blob</sub> and n number of collection blobs. 
</p>

<p>
These have a horizontal relationship. 
</p>

<p>
Also the composite blob, though a class was not declared for it, still it counts as a discrete object and hence, it is reasonable to consider it a blob. 
</p>

<p>
There might be super abstract blobs that are hidden in the form of java library but then as much as possible we will disregard them. And consider only those blobs or superblobs that are visible in the code body. 
</p>

<p>
That weird relationship between those objects which extended a super abstract object thus making a single blob or by virtue of the vertical nature they were a single blob but then the concrete blobs which can have an independent existence and one of them was related to the other, like the parent type was acceptable to one of the child branches. This is the weird relation that I am talking about. I have seen this before and that weird back curving arrow. 
</p>
</div>
</div>
