javanotes.org
** composite pattern fixed

In the composite pattern we have the menu object, the menu class, despite the constructor which takes a string or two in the constructor, does not really have anything to do with it. It initializes an arraylist and that is what is the deal with menu. So the constructor has nothing to do with how it has to or has the main deal of creating and populating an arraylist. 

The constructor could have been blank and it would not have made much of a difference. In this point the constructor is just like those tags or labels on a jar. If you create a jar the constructor mandates that you put in a name and description in the label. 

Marker page 412 : component pattern or sorry, it is composite pattern

