javanotes.html










<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> composite pattern fixed</h3>
<div class="outline-text-3" id="text-1-20">
<p>
In the composite pattern we have the menu object, the menu class, despite the constructor which takes a string or two in the constructor, does not really have anything to do with it. It initializes an arraylist and that is what is the deal with menu. So the constructor has nothing to do with how it has to or has the main deal of creating and populating an arraylist. 
</p>

<p>
The constructor could have been blank and it would not have made much of a difference. In this point the constructor is just like those tags or labels on a jar. If you create a jar the constructor mandates that you put in a name and description in the label. 
</p>

<p>
Marker page 412 : component pattern or sorry, it is composite pattern
</p>
</div>
</div>
