javanotes.html

<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> strategy pattern</h3>
<div class="outline-text-3" id="text-1-21">
<p>
Now to start from the very start. 
First a single blob, duck blob. 
Then three blobs, duck blob, quackable blob and flyable blob. 
Duck is a superclass, quackable and flyable are interfaces. 
The concretes are shared between the three super classes or interfaces. 
This just got complicated. 
Just got complicated. 
</p>

<div class="org-src-container">

<pre class="src src-java">duck(a1, a2, a3, a4 ....); where a1, a2, a3 etc are concretes
flyable(b1, b2, b3, b4 ...); where b1, b2, b3 are classes, concrete single blob classes.
quackable(c1, c2, c3, c4 ...); where c1, c2, c3 ... are classes, single blob concretes.
</pre>
</div>
<p>
Can the duck concrete choose to implement interfaces, or is this doen by the super class above it.
</p>
<div class="org-src-container">

<pre class="src src-java">new concrete duck ( flyable object = new flyable concrete class of my choice, that is b1 or b2 or b3 or whatever;
quackable object( new concrete quackable object of my choice, that is c1 or c2 or c3 ... );
</pre>
</div>
<p>
again reset;
</p>
<div class="org-src-container">

<pre class="src src-java">duck super parent abstract superclass ( concretes a1, a2, a3, a4 ....);
flybehaviour interface( concrete classes b1, b2, b3 ...)
quackbehaviour interface ( concrete classes c1, c2, c3 ....);
</pre>
</div>


<p>
b1, b2, b3, b4 &#x2026;. implement the flybehaviour interface;
c1, c2, c3, c4 &#x2026;.. implement the quackbehaviour interface.
</p>

<p>
Parent super abstract duck class does not implement flybehaviour interface or quackbehaviour interface, it has references to then in the form of reference variables, "REFERENCE VARIABLES", flybehaviour myflybehaviour; quackbehaviour myquackbehaviour;
</p>

<p>
The main thing here are the super abstract class, the duck class, the two interfaces flybehaviour and the quackbehaviour. All the important things seem to happen in the super abstract class of duck, it has REFERENCE VARIABLES to flybehaviour and quackbehaviour. 
</p>

<p>
When you look at it and see how convoluted it is, you want to use something like uml or flowcharts but then that too gets confusing. 
</p>

<p>
What kind of arrows do I show for horizontal relationship. 
</p>

<p>
They are calling the flybehaviour and quackbehavior interfaces together with there sub classes that implement them as a blob an encapsulated blob. 
</p>

<p>
So two encapsulated blobs, the flying behavior and the quackbehaviour
</p>

<p>
And then there is the other blob, the duck blob. 
</p>

<p>
End this part, end this part. 
</p>

<p>
There is this saying
</p>

<p>
Prefer composition over inheritance. 
</p>

<p>
First of all you have the super abstract class, the class duck and then under it were the sub classes, the concretes. 
</p>

<p>
Then you took some of the attributes of the duck super class the quack behavior and the fly behavior and put it outside of the duck super abstract thing. In and interface, in two interfaces for two of them and then put the concrete sub classes that implement them under them. All those things or aggregates of it were said to be encapsulated. 
</p>

<p>
But that is not the point. 
</p>

<p>
The point is that since the attribute is outside of the abstract superclass and in an interface. The subclasses will not inherit the attributes by inheritance but by REFERENCE VARIABLES to the interfaces and your choice of concrete subclassses that subtend the interfaces. 
</p>

<p>
That is composition, not automatic inheritance of attributes. 
</p>

<p>
This above pattern is the strategy pattern. 
</p>

<pre class="example">
strategy: super abstract blob(concrete1, concrete2 ....)

super abstract blob --&gt;&gt; attributes --&gt;&gt; take an attributes or two out of this blob and put it in an interface.
the interface cluster --&gt;&gt; encapsulated blob
</pre>

<p>
So all your business blobs that is the concretes under the super abstract blob will use what is inherited from above and also use attributes from interfaces using REFERENCE VARIABLES. 
</p>

<p>
Strategy: start with inheritance. Take out attributes and put in interfaces. Destroy some inheritance and replace with composition. REFERENCE VARIABLES. 
</p>

<p>
Strategy pattern: first you have a blob, could be vertically divided, into branches, vertically divided so we do not care, this is vertically divided, why? you ask. Because the top half is abstract and the bottom half is concrete, that is why. 
</p>

<p>
This superblob, I mean the entirety, divide horizontally that is one is the blob and the other is an interface blob and another interface blob. Now the division is horizontal. Why horizontal, there is no abstract or concrete relation between them. They are independent. The main blob connects with the interface blobs with REFERENCE VARIABLES. 
</p>

<p>
The phrase "encapsulate what varies" ????
</p>

<p>
Imagine an innocent blob, take a closer look and it has a super abstract blob which subtends concrete blobs. Now we strike, we take that blob and look under microscope at what are the attributes that can be taken out, like finding the lowest common factor and we take them out and put them under interface. The cluster of interface and the concretes that implement it are said to be encapsulated. 
</p>

<p>
So the phrase "encapsulate what varies"
</p>

<p>
One that is common, this can do with inheritance. Keep it in the super abstract class blob. 
</p>

<p>
One that varies, this cannot be inherited by all, pull it out into discrete blobs called interfaces and their aggregates called encapsulated blobs. 
</p>

<p>
Inheritance for those attributes that are common. 
</p>

<p>
Composition for those attributes that vary. 
</p>

<p>
Composition: discrete interface blobs: keyword used in main blob &#x2013;&gt;&gt; REFERENCE VARIABLES
</p>

<p>
The phrase "program to interfaces, not implementations"
</p>

<p>
Say you have blobs like proper blobs they might be vertically divided but then we are not considering the vertical divisions or are we. 
</p>

<p>
The blobs should refer to other blobs, but in a certain way. The arrow should point to the abstract part of another blob not to the concrete part of the other blob. 
</p>

<pre class="example">
blob_a, blob_b, blob_c
blob_a has REFERENCE VARIABLES that point to blob_b and blob_c
blob_a has REFERENCE VARIABLES, that point to the blob_b_abstract-super and blob_c_abstract-super.
blob_a_concretes are free to choose their blob_b_concretes and blob_c_concretes.
</pre>

<p>
the phrase "program to an interface, not an implementation"
</p>

<p>
"program to an interface, not to a concrete"
</p>

<p>
take a blob, a proper blob with vertical divisions. now pull out some attributes and put them into interfaces. hae the original blob point to the interface blobs so that the original blob points to the parent, root, abstract interface node , not the concrete branches. now you are free to do the concretes for all of them, and see how the important task of attending to the top layer or how the top layer of blob-a and blob-b and blob-c determines or gives you freedom when you make concretes of blob-a blob-b and blob-c.
</p>

<p>
uml is still kind of dodgy and throws me off.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: majhi</p>
<p class="date">Created: 2018-10-28 Sun 20:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
